public class main {
    public static void main(String[] args) {

        int ticketCost = 2000; //стоимость билета
        int oneMile = 20; //количетсво рублей за одну милю
        int  miles;

        miles = ticketCost/oneMile;

        System.out.println("количество миль:" + miles);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
